# g = [("小冯",98),("小李",96)]
# print(g)
# g[1]=("小李",60)
# print(g)

# def jj(x):
#     x*=2
#     return x
# ls = [1,2]
# print(jj(ls))
# print(ls)

result="不满意,一般,很满意,一般,不满意,很满意,满意,一般,一般,一般,"\
            "不满意,满意,满意,满意,满意,满意,一般,很满意,一般,满意,一般,"\
            "不满意,满意,一般,不满意,满意,不满意,满意,很满意,很满意,一般,"\
            "满意,满意,不满意,满意,不满意,满意,一般,很满意,不满意,很满意,"\
            "一般,很满意,满意,很满意,不满意,很满意,不满意,很满意,不满意,"\
            "满意,满意,很满意,一般,很满意,满意,满意,很满意,不满意,很满意,"\
            "很满意,满意,不满意,满意,不满意,满意,很满意,满意,很满意,不满意,"\
            "一般,很满意,很满意,很满意,不满意,满意,一般,一般,一般,不满意,"\
            "一般,不满意,不满意,满意,很满意,很满意,满意,满意,很满意,不满意"
com = ['不满意','一般','满意','很满意']
relist = result.split(",")
max = 0
maxcom = ""
for i in com:
    print(f"{i}:{relist.count(i)}")
    if relist.count(i)>max:
        max = relist.count(i)
        maxcom = i
print(f"最多的-{maxcom}:{max}")
