# e

# dicAreas = {[1707.5,'莫斯科']:'俄罗斯',[997.1,'渥太华']:'加拿大',[960.1,'北京']:'中国'}

# dicAreas = {(1707.5,'莫斯科'):'俄罗斯',(997.1,'渥太华'):'加拿大',(960.1,'北京'):'中国'}
# print(dicAreas)
# dicDatas={'2022年': [1210207.2, 141217.5], '2021年': [1149237.0, 141236], '2020年':[1013567.0, 141110]}
# print(dicDatas['2022年'][0]+dicDatas['2022年'][1])

# dicGDP['2022年']=3423444.3

dic_morse={"A":"•−","B":"−•••","C":"−•−•","D":"−••","E":"•","F":"••−•","G":"−−•",
           "H":"••••","I":"••","J":"•−−−","K":"−•−","L":"•−••","M":"−−","N":"−•",
           "O":"−−−","P":"•−−•","Q":"−−•−","R":"•−•","S":"•••","T":"−",
           "U":"••−","V":"•••−","W":"•−−","X":"−••−","Y":"−•−−","Z":"−−••"}
input_str=input("请输入要转换的英文字符串：").upper()
output_str=""
for i in input_str:
    if i in dic_morse:
        output_str+=dic_morse[i]
        print(dic_morse[i],end=" ")
print()
print(output_str)